// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині

// let arrDiv = [];
// for (i=0; i < 10; i++) {
//     arrDiv.push("<div>text<\div>");
// }
// document.write(arrDiv)

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині

// let arrDiv = [];
// for (i=0; i < 10; i++) {
//     arrDiv.push("<div>text<\div>" + i);
// }
// document.write(arrDiv);

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.

// let arrDiv = [];
// let i = 0;
// while (i < 20) {
//     arrDiv.push("<h1>text<\h1>");
//     i++;
// }
// document.write(arrDiv);

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.

// let arrDiv = [];
// let i = 0;
// while (i < 20) {
//     arrDiv.push("<h1>text<\h1>" + i);
//     i++;
// }
// document.write(arrDiv);

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.

// let num = [2, -10, 3, 9, 22, -3, 11, 18, 1, 7];
// for (i =0; i < num.length; i++) {
//     console.log(num[i]);
// }

// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.

// let str = ["open", "Kyiv", "hello", "drink", "JavaScript", "mobile", "king", "fcdk", "silver", "march"];
// for (i =0; i < str.length; i++) {
//     console.log(str[i]);
// }

// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.

// let mix = [2, -10, "silver", true, 22, -3, "Lviv", 18, false, 7];
// for (i =0; i < mix.length; i++) {
//     console.log(mix[i]);
// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи

// let mix = [2, -10, "silver", true, 22, -3, "Lviv", 18, false, 7];
// for (i =0; i < mix.length; i++) {
//     if (typeof mix[i] == "boolean") {
//         console.log(mix[i]);
//     };
// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи

// let mix = [2, -10, "silver", true, 22, -3, "Lviv", 18, false, 7];
// for (i =0; i < mix.length; i++) {
//     if (typeof mix[i] == "number") {
//         console.log(mix[i]);
//     };
// }

// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи

// let mix = [2, -10, "silver", true, 22, -3, "Lviv", 18, false, 7];
// for (i =0; i < mix.length; i++) {
//     if (typeof mix[i] == "string") {
//         console.log(mix[i]);
//     };
// }

// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів.
// Вивести в консоль всі його елементи в циклі.

// let arr = [];
// arr[0] = true;
// arr[1] = 2;
// arr[2] = "okten";
// arr[3] = 9;
// arr[4] = -12;
// arr[5] = false;
// arr[6] = 5;
// arr[7] = "Kyiv";
// arr[8] = 1;
// arr[9] = "cool";
//
// for (i = 0; i < arr.length; i++) {
//     console.log(arr[i]);
// }


// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

// for (i = 0; i < 10; i++) {
//     console.log(i);
//     document.write(i + "<br>");
// }

// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

// for (i = 0; i < 100; i++) {
//     console.log(i);
//     document.write(i + "<br>");
// }

// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write

// for (i = 0; i < 200; i+=2) {
//     console.log(i);
//     document.write(i + "<br>");
// }

// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write

// for (i = 0; i < 100; i++) {
//     if (i % 2 == 0) {
//     console.log(i);
//     document.write(i + "<br>");
//     };
// }

// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write

// for (i = 0; i < 101; i++) {
//     if (i % 2 == 1) {
//         console.log(i);
//         document.write(i + "<br>");
//     };
// }

// - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)

// for (let min = 0; min <= 2; min++){
//     for (let sek = 0; sek <= 59; sek++){
//         document.write(min + " хв" + " " + sek + " сек" + "<br>");
//         if (min == 2 && sek == 0) {
//         break;
//         };
//     };
// }

// - Відтворити роботу годинника, відрахувавши  2 години 20 хвилини (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)

// for (let hour = 0; hour <= 2; hour++) {
//     for (let min = 0; min <= 59; min++) {
//         if (hour == 2 && min == 21 && sek == 0) {
//             break;
//         };
//         for (let sek = 0; sek <= 59; sek++) {
//             document.write(hour + " год" + " " + min + " хв" + " " + sek + " сек" + "<br>");
//         };
//     };
// }

// Додатково
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.

// let arr = [ 'a', 'b', 'c'];
// for (i = 0; i < arr.length; i++) {
//     document.write(arr[i]);
// }

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.

// let arr = [ 'a', 'b', 'c'];
// i = 0;
// while (i < arr.length) {
//     document.write(arr[i]);
//     i++;
// }

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.

// const arr = [ 'a', 'b', 'c'];
// for (const element of arr) {
//     document.write(element);
// }

// =================
// =================
// =================
// =================
//
// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.

// let arr = ['a', 'b', 'c'];
// for (i=0; i < 3; i++) {
//     arr.push(i+1);
// }

// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].

// let arr = [1, 2, 3];
// arr.reverse();
// console.log(arr);

// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.

// let arr = [1, 2, 3];
// arr.push(4);
// arr.push(5);
// arr.push(6);

// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.

// let arr = [1, 2, 3];
// arr.unshift(6);
// arr.unshift(5);
// arr.unshift(4);

// - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()

// let arr = ['js', 'css', 'jq'];
// console.log(arr.shift());

// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()

// let arr = ['js', 'css', 'jq'];
// console.log(arr.pop());

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [3, 4, 5].

// let arr = [1, 2, 3, 4, 5];
// let arrNew = arr.slice(2,5);

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [4, 5].

// let arr = [1, 2, 3, 4, 5];
// let arrNew = arr.slice(3,5);

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].

// let arr = [1, 2, 3, 4, 5];
// let arrNew = arr.slice(0,2);

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].

// let arr = [1, 2, 3, 4, 5];
// arr.splice(3, 0, 'a', 'b', 'c');

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].

// let arr = [1, 2, 3, 4, 5];
// arr.splice(1, 0, 'a', 'b');
// arr.splice(6, 0, 'c');
// arr.splice(8, 0, 'e');

// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.

// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
// for (i = 0; i < arr.length; i++) {
//     if (arr[i] % 2 == 0) {
//         console.log(arr[i]);
//     };
// }

// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push ()
// скопіювати значення одного масиву в інший

// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
// let arrNew = [];
// for (i = 0; i < arr.length; i++) {
//     arrNew.push(arr[i]);
// }

// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати
// значення одного масиву в інший.

// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
// let arrNew = [];
// for (i = 0; i < 10; i++) {
//     arrNew.unshift(arr.pop(i));
// }
